{
    "id": "curriculum_2025_27",
    "name": "Curriculum 2025-27",
    "description": "Curriculum for the 2025-27 school years",
    "courses": [
        {
            "id": "25_26_pesk",
            "name": "Personal Skills",
            "description": "<p>In dit opleidingsonderdeel ontdek je studie- en planningsvaardigheden zoals tijdmanagement, zelfsturing en reflectie. Je ontwikkelt communicatieve vaardigheden voor werk en sociale situaties, van schrijven en gesprekken voeren tot samenwerken in teams. Je stelt een persoonlijk actie- en ontwikkelplan op om je doelen te bereiken, met aandacht voor ethiek en professionele groei.</p>",
            "credits": 4,
            "contactHoursPerWeek": 4,
            "period": "1+2",
            "semester": 1,
            "learningLineCode": "ics",
            "lecturers": ["IVC", "SSG"],
            "tags": [
                "persoonlijke ontwikkeling",
                "professionele communicatie"
            ]
        },
        {
            "id": "25_26_prsk",
            "name": "Professional Skills",
            "description": "<p>In dit vak ontwikkel je jouw professionele communicatievaardigheden via interview-, presentatie- en vergadertechnieken, bedrijfsrollen en doelgroepgerichte communicatie. Je ontdekt methodologieën zoals Waterfall, Agile, Scrum en Kanban. Daarnaast bereid je je grondig voor op sollicitaties via cv, motivatiebrief, elevator pitch en videosollicitaties. Je bouwt ook aan je persoonlijke portfolio met een website, LinkedIn en andere valabele platformen.</p><p>Je maakt kennis met professionals die je toekomstige job uitoefenen, via inspirerende talks en interactieve sessies. Je leert niet alleen van hun ervaring, maar krijgt ook inzicht in de samenwerking met collega’s zoals back-end developers, front-end developers, CMS developers, UI/UX designers, marketeers, project managers en teamleads – cruciaal om als professional succesvol te zijn in een multidisciplinair team.</p>",
            "credits": 4,
            "contactHoursPerWeek": 4,
            "period": "3+4",
            "semester": 2,
            "learningLineCode": "ics",
            "lecturers": ["IVC", "SSG"],
            "tags": [
                "persoonlijke ontwikkeling",
                "professionele communicatie",
                "bedrijfscommunicatie",
                "solliciteren",
                "portfolio"
            ]
        },
        {
            "id": "25_26_itexpl",
            "name": "Agile Skills",
            "description": "<p>In Agile Skills leer je professionele, toekomstgerichte vaardigheden ontwikkelen voor het werken aan creatieve digitale projecten binnen een agile, multidisciplinaire context.</p><p>Je verdiept je in:<ul><li>trends & technologieën met focus op innovatie en impact,</li><li>onderzoek en design thinking in digitale projecten,</li><li>ambassadeurschap en communityvorming rond web, mobile en cloud development,</li><li>werkplekleren en zelfstandig functioneren binnen een leerbedrijf.</li></ul><p>De focus ligt op wendbaarheid, samenwerking, maatschappelijke relevantie en digitale impact.</p>",
            "credits": 6,
            "contactHoursPerWeek": 4,
            "period": "5+6",
            "semester": 3,
            "learningLineCode": "ics",
            "lecturers": ["TBD"],
            "tags": [
                "ambassadeursschap",
                "design research",
                "trends en innovaties",
                "werkplekleren"
            ]
        },
        {
            "id": "25_26_dtman1",
            "name": "Data Management 1",
            "subName": "Essentials",
            "description": "<p>In dit opleidingsonderdeel maak je kennis met de fundamenten van databeheer, van het herkennen van verschillende datatypen tot het begrijpen van hoe data worden opgeslagen, gestructureerd en uitgewisseld. Je leert de basisprincipes van databases en netwerkprotocollen kennen, en verkent de rol van cloud computing in moderne IT-omgevingen. Via praktische oefeningen werk je met dataformaten zoals CSV en JSON en schrijf je eenvoudige SQL-query’s.</p>",
            "credits": 3,
            "contactHoursPerWeek": 4,
            "period": 1,
            "semester": 1,
            "learningLineCode": "dtm",
            "lecturers": ["AGB"],
            "tags": [
                "data",
                "databases",
                "internet",
                "web"
            ]
        },
        {
            "id": "25_26_dtman2",
            "name": "Data Management 2",
            "subName": "Content Management Systems",
            "description": "<p>In dit opleidingsonderdeel leer je hoe je inhoud op een gestructureerde, veilige en performante manier beheert via een content managementsysteem (CMS). Je zet een lokale ontwikkelomgeving op, leert werken met versiebeheer via GitHub en past continuous deployment toe. Je verdiept je in programmeervaardigheden zoals PHP en objectgeoriënteerd programmeren, en gebruikt die kennis om een CMS te configureren en uit te breiden. Je ontdekt hoe je content structureert, gebruikersrechten beheert en je systeem beveiligt. Tot slot ontwerp en ontwikkel je een gebruiksvriendelijk en herbruikbaar thema met een templating engine zoals Twig.</p>",
            "credits": 3,
            "contactHoursPerWeek": 4,
            "period": 3,
            "semester": 2,
            "learningLineCode": "dtm",
            "lecturers": ["FRG"],
            "tags": [
                "php",
                "databases",
                "cms",
                "craftcms"
            ]
        },
        {
            "id": "25_26_dtman3",
            "name": "Data Management 3",
            "subName": "PHP Frameworks",
            "description": "<p>In dit opleidingsonderdeel leer je gestructureerd webapplicaties bouwen met behulp van het PHP-framework Laravel. Je start met het opzetten van een lokale ontwikkelomgeving en verdiept je in databases, SQL en objectgeoriënteerd programmeren met PHP. Je leert hoe je gebruikersinput verwerkt, beveiligt en valideert, en hoe je met PDO data beheert via MySQL en SQLite. Daarna pas je het MVC-patroon toe in Laravel en werk je met krachtige tools zoals Eloquent ORM, Laravel Mix en Sanctum. Je verkent ook kort Filament en andere Laravel-extensies. Zo bouw je stapsgewijs aan een veilige, schaalbare en onderhoudbare applicatie.</p>",
            "credits": 6,
            "contactHoursPerWeek": 8,
            "period": 5,
            "semester": 3,
            "learningLineCode": "dtm",
            "lecturers": ["DDW"],
            "tags": [
                "php",
                "oop",
                "laravel",
                "eloquent"
            ]
        },
        {
            "id": "25_26_web1",
            "name": "Web 1",
            "subName": "Essentials",
            "description": "<p>In dit opleidingsonderdeel maak je kennis met de fundamenten van het web. Je leert hoe moderne webbrowsers werken en hoe je er gebruik van maakt om te ontwerpen, inspecteren en debuggen. Je krijgt inzicht in webstandaarden zoals HTML en CSS en leert correcte, semantische en gestructureerde webpagina’s opbouwen volgens hedendaagse normen.Je past deze kennis toe bij het coderen van statische en responsieve websites, met aandacht voor structuur, visuele opbouw, toegankelijkheid en basisresponsiviteit.</p>",
            "credits": 4,
            "contactHoursPerWeek": 6,
            "period": 1,
            "semester": 1,
            "learningLineCode": "cwc",
            "lecturers": ["DPS", "KDS", "TBD"],
            "tags": [
                "html",
                "css"
            ]
        },
        {
            "id": "25_26_web2",
            "name": "Web 2",
            "subName": "Intermediate",
            "description": "<p>In het opleidingsonderdeel Web 2: Intermediate verdiep je je verder in het bouwen van moderne, performante en toegankelijke websites. Je leert geavanceerde technieken in HTML en CSS, en hoe je media zoals afbeeldingen, audio en video correct en responsief integreert. Daarnaast werk je aan structurele en semantische opbouw van webpagina’s met aandacht voor SEO en toegankelijkheid.</p><p>In dit vak worden AI-tools actief ingezet als programmeerassistent. Je leert hoe artificiële intelligentie je kan helpen om HTML- en CSS-code te begrijpen en te verbeteren. AI wordt ook ingezet om foutmeldingen te verklaren, suggesties te doen voor optimalisatie, en technische documentatie te schrijven bij je code.</p><p>Je maakt ook kennis met Figma, zodat je als developer inzicht krijgt in de designflow en tools waarmee UX/UI-designers werken. Zo wordt de samenwerking met designers versterkt.</p>",
            "credits": 4,
            "contactHoursPerWeek": 6,
            "period": 2,
            "semester": 1,
            "learningLineCode": "cwc",
            "lecturers": ["MVP", "DPS", "TBD"]
        },
        {
            "id": "25_26_web3",
            "name": "Web 3",
            "subName": "Advanced",
            "description": "<p>In dit opleidingsonderdeel verdiep je je in geavanceerde front-endtechnieken en moderne webstandaarden. Je leert hoe je schaalbare, performante en toegankelijke gebruikersinterfaces bouwt met aandacht voor semantische HTML, geavanceerde CSS-architecturen, webcomponents en progressive web apps. Je werkt met tools zoals webpack, Parcel en Rollup voor projectautomatisatie en past coding style guides toe om consistente en onderhoudbare code te schrijven.</p><p>Daarnaast leer je hoe je digitale toepassingen toegankelijk maakt volgens de WCAG-richtlijnen, hoe je user testing uitvoert en hoe je interfaces valideert op basis van UX-principes. AI-tools worden ingezet als assistent bij het genereren, verbeteren, begrijpen en documenteren van HTML, CSS en technische documentatie.</p>",
            "credits": 4,
            "contactHoursPerWeek": 6,
            "period": 3,
            "semester": 2,
            "learningLineCode": "cwc",
            "lecturers": ["AGB", "SVP"]
        },
        {
            "id": "25_26_web4",
            "name": "Web 4",
            "subName": "Web Animations & Interactions",
            "description": "<p>In dit opleidingsonderdeel specialiseer je je in animatie, interacties en geavanceerde visuele interfaces voor het web. Je leert hoe je 2D- en 3D-animaties genereert, aanstuurt en implementeert in een hedendaagse front-endomgeving.</p><p>Je werkt met professionele tools zoals Lottie Editor, Rive en Spline voor het ontwerpen en implementeren van motion graphics. Je integreert deze creaties in webprojecten met behulp van webstandaarden (Canvas API, Web Animation API, Intersection Observer) en moderne animatiebibliotheken zoals GSAP, Lottie en Three.js. Je experimenteert met JavaScript 3D-frameworks gebaseerd op WebGL en zet stappen richting toepassingen in VR en AR. AI-tools worden o.a. ingezet voor het genereren van 2D- en 3D-content, als creatieve en technische assistent.</p>",
            "credits": 4,
            "contactHoursPerWeek": 6,
            "period": 4,
            "semester": 2,
            "learningLineCode": "cwc",
            "lecturers": ["AGB"]
        },
        {
            "id": "25_26_web5",
            "name": "Web 5",
            "subName": "Web Frameworks",
            "description": "<p>In dit opleidingsonderdeel leer je moderne webapplicaties bouwen met React als centrale technologie. React is een krachtig JavaScript-framework dat toelaat om schaalbare, interactieve en onderhoudbare gebruikersinterfaces te bouwen op basis van componenten. Je ontwikkelt een diepgaand inzicht in frontendarchitectuur, routing, state management, animaties, testing en styling.</p><p>Daarnaast leer je werken met professionele ontwikkeltools, projectstructuren en workflows zoals CI/CD en geavanceerd gebruik van Git. AI-tools worden optioneel ingezet ter ondersteuning bij codeaanvulling, debugging en testgeneratie.</p>",
            "credits": 6,
            "contactHoursPerWeek": 8,
            "period": 5,
            "semester": 3,
            "learningLineCode": "cwc",
            "lecturers": ["MVP"],
            "specializationCode": "ifd"
        },
        {
            "id": "25_26_web6",
            "name": "Web 6",
            "subName": "Creative Coding",
            "description": "<p>In dit opleidingsonderdeel combineer je technologie met creativiteit. Je leert interactieve, experimentele webprojecten bouwen met tools zoals React, WebGL, game engines, voice interfaces, XR en cloud backends.</p><p>Je verkent nieuwe vormen van gebruikersinteractie — denk aan spraak, beweging, AI-chatbots of 3D-omgevingen — en ontwikkelt projecten waarin creativiteit en webtechnologie samenkomen.</p><p>Daarnaast leer je werken met moderne ontwikkeltools, projectstructuren, CI/CD en BaaS-diensten. Je zet een workflow op zoals in professionele teams: met Git, pull requests, project boards en automation.</p>",
            "credits": 6,
            "contactHoursPerWeek": 8,
            "period": 6,
            "semester": 3,
            "learningLineCode": "cwc",
            "lecturers": ["NMN"],
            "specializationCode": "ifd"
        },
        {
            "id": "25_26_prgm1",
            "name": "Programming 1",
            "subName": "Essentials",
            "description": "<p>In dit opleidingsonderdeel leer je de fundamenten van programmeren aan de hand van JavaScript en Node.js. Naast de syntax en opbouw van de taal leer je werken met control structures, functies, collecties en objecten. Er is aandacht voor debugging en interactie met de browser via de DOM. Daarnaast leer je zelfstandig werken met versiebeheer (Git) en gebruik je AI-tools als leerondersteuning, foutendetector en documentatie-assistent. Je ontwikkelt een basis om stapsgewijs complexe opdrachten zelfstandig op te lossen.</p>",
            "credits": 5,
            "contactHoursPerWeek": 8,
            "period": 1,
            "semester": 1,
            "learningLineCode": "cmp",
            "lecturers": ["MVP", "NMN"],
            "tags": [
                "javascript",
                "nodejs",
                "html",
                "css"
            ]
        },
        {
            "id": "25_26_prgm2",
            "name": "Programming 2",
            "subName": "Intermediate",
            "description": "<p>In dit opleidingsonderdeel verdiep je je programmeervaardigheden met JavaScript en Node.js. Je leert werken met moderne programmeerconcepten zoals destructuring, promises, asynchroon programmeren en foutafhandeling. Je schrijft gestructureerde, leesbare en onderhoudbare code volgens richtlijnen en standaarden, en je leert deze ook testen en documenteren. Daarnaast ontwikkel je inzicht in server-side ontwikkeling met Node.js en Express, en bouw je toepassingen op basis van de MVC-architectuur. AI-tools worden actief ingezet als coding assistent die je helpt bij het begrijpen, genereren, verbeteren en documenteren van code, algoritmes, architecturen en technische documentatie.</p>",
            "credits": 5,
            "contactHoursPerWeek": 8,
            "period": 2,
            "semester": 1,
            "learningLineCode": "cmp",
            "lecturers": ["AGB", "TBD"],
            "tags": [
                "javascript",
                "nodejs",
                "express",
                "html",
                "css"
            ]
        },
        {
            "id": "25_26_prgm3",
            "name": "Programming 3",
            "subName": "JAMstack",
            "description": "<p>In dit opleidingsonderdeel leer je moderne webapplicaties bouwen volgens het JAMStack-principe (JavaScript, API's en Markup), met React als centrale bouwsteen. React is een krachtig JavaScript-framework voor het bouwen van interactieve, componentgebaseerde gebruikersinterfaces. Je leert werken met moderne ontwikkeltools, frontendarchitecturen, headless CMS’en zoals Strapi, en professionele workflows zoals CI/CD en geavanceerde Git-strategieën. Daarnaast gebruik je AI-tools als programmeerpartner voor autocompletion, testgeneratie, debugging en het verbeteren van codekwaliteit.</p>",
            "credits": 5,
            "contactHoursPerWeek": 8,
            "period": 3,
            "semester": 2,
            "learningLineCode": "cmp",
            "lecturers": ["NMN", "KDS"],
            "tags": [
                "javascript",
                "nodejs",
                "typescript",
                "sqlite",
                "orm",
                "express",
                "html",
                "css"
            ]
        },
        {
            "id": "25_26_prgm4",
            "name": "Programming 4",
            "subName": "Back-end",
            "description": "<p>In dit opleidingsonderdeel leer je professionele, veilige en onderhoudbare backendtoepassingen ontwikkelen met TypeScript en het Express-framework binnen een MVC-architectuur. Je leert REST API’s bouwen, documenteren, testen en beveiligen. Er is aandacht voor database modelling, ORM-mapping en het gebruik van migrations. AI-tools worden geïntegreerd in het ontwikkelproces als assistent voor codering, testing en het ontwerpen van databasestructuren.</p>",
            "credits": 4,
            "contactHoursPerWeek": 6,
            "period": 4,
            "semester": 2,
            "learningLineCode": "cmp",
            "lecturers": ["KDS", "NMN"]
        },
        {
            "id": "26_27_prgm5",
            "name": "Programming 5",
            "subName": "Full-stack",
            "description": "<p>In dit opleidingsonderdeel ontwikkel je volwaardige, moderne full-stack webapplicaties met de JavaScript/TypeScript-stack, waarbij de nadruk ligt op een componentgerichte, schaalbare en veilige aanpak. Je werkt met zowel full-stack frameworks zoals Next.js of Remix, als met headless CMS voor back-end contentbeheer.</p><p>Je leert hoe je data structureert, API’s bouwt (REST/GraphQL), geavanceerde UI’s uitwerkt, cloud deployment beheert en AI-tools integreert voor codegeneratie, automatisatie en interactie met gebruikers. Ook real-time communicatie, praktische tools en testing komen aan bod.</p>",
            "credits": 6,
            "contactHoursPerWeek": 8,
            "period": 5,
            "semester": 3,
            "learningLineCode": "cmp",
            "lecturers": ["KDS"]
        },
        {
            "id": "26_27_prgm6",
            "name": "Programming 6",
            "subName": "Mobile",
            "description": "<p>In dit opleidingsonderdeel ontwerp en ontwikkel je professionele mobiele applicaties voor smartphones en tablets. Je werkt met hybride frameworks zoals React Native, Ionic of Flutter, waarbij je native functionaliteiten zoals camera, gps en notificaties integreert via plugins.</p><p>Je leert ook hoe je apps efficiënt test, beveiligd, en uitrolt naar productie via mobiele deploymenttools zoals Expo en Fastlane. Cloud services zoals Supabase worden ingezet als back-end. AI wordt gebruikt als assistent bij het genereren van ideeën, wireframes, user flows en documentatie.</p>",
            "credits": 6,
            "contactHoursPerWeek": 8,
            "period": 6,
            "semester": 3,
            "learningLineCode": "cmp",
            "lecturers": ["MVP"]
        },
        {
            "id": "25_26_atw1",
            "name": "@Work 1",
            "subName": "Static Web Projects",
            "description": "<p>In dit opleidingsonderdeel passen studenten hun verworven kennis uit de opleidingsonderdelen Data Management 1, Web 1: Essentials en Programming 1: Essentials toe in een realistisch projectkader.</p><p>Je werkt aan opdrachten die gebaseerd zijn op concrete voorbeelden uit de industrie. De focus ligt op het ontwikkelen van de client-side van dynamische webapplicaties. Je vertrekt daarbij van professionele input: een uitgewerkte informatiearchitectuur, visueel ontwerp en UI-stijlgidsen, aangeleverd door externe professionals uit het werkveld.</p><p>Deze praktijkgerichte aanpak laat toe om technische vaardigheden te verdiepen, gestructureerd samen te werken en ervaring op te doen met het vertalen van een design naar een functionele gebruikersinterface.</p>",
            "credits": 6,
            "contactHoursPerWeek": 8,
            "period": 2,
            "semester": 1,
            "learningLineCode": "atw",
            "lecturers": ["DPS", "KDS"]
        },
        {
            "id": "25_26_atw2",
            "name": "@Work 2",
            "subName": "Dynamic Web Projects",
            "description": "<p>In het opleidingsonderdeel @work 2 werk je als team in een gesimuleerde professionele context aan een project voor een realistische opdrachtgever. De focus ligt op het realiseren van een open source project én een dynamische webapplicatie. Je hanteert hierbij de Agile Methodology en volgt het designproces: Discover – Define – Design – Develop – Deliver – Deploy.</p><p>Je leert samen te werken in een complementair team waarbij je inzichten en vaardigheden integreert uit eerder gevolgde opleidingsonderdelen zoals Data Management 2: Content Management, Web 3: Advanced, Programming 3: JAMstack en Professional Development.</p><p>Je ontwikkelt je verder in projectbeheer, versiebeheer met Git en Gitflow, CI/CD-principes, en versterkt je teamwerk, communicatie en probleemoplossend vermogen.</p>",
            "credits": 6,
            "contactHoursPerWeek": 8,
            "period": 4,
            "semester": 2,
            "learningLineCode": "atw",
            "lecturers": ["FRG", "SVP"]
        },
        {
            "id": "26_27_atw3",
            "name": "@Work 3",
            "subName": "Multidisciplinary Web Projects",
            "description": "<p>In dit opleidingsonderdeel werk je als multidisciplinair team aan een reëel project in een gesimuleerde werkcontext voor een externe klant. Je doorloopt het volledige designproces: Discover – Define – Design – Develop – Deliver – Deploy, met als doel een professioneel, geïntegreerd eindproduct op te leveren. Het volledige process wordt gedocumenteerd in een productiedossier.</p><p>Je ontwikkelt een gebruiksvriendelijke, toegankelijke, responsieve en performante dynamische webapplicatie met met een custom content management systeem (afhankelijk van het project gebruik je Next.js of Remix in combinatie met Strapi of Sanity of je gebruikt Laravel).</p><p>Je integreert kennis en vaardigheden uit o.a. Data Management 3: PHP Frameworks, Programming 5: Full-stack, Web 5: Web Frameworks en Agile Skills. Het team beheert het project via Notion en/of GitHub projectboard, met duidelijke taakverdeling, feature tracking en documentatie.</p>",
            "credits": 9,
            "contactHoursPerWeek": 14,
            "period": 6,
            "semester": 3,
            "learningLineCode": "atw",
            "lecturers": ["DDW", "KDS"]
        },
        {
            "id": "26_27_atw4",
            "name": "@Work 4",
            "subName": "Graduation Project",
            "description": "<p>In dit opleidingsonderdeel werk je individueel aan je afstudeerproject of eindwerk in opdracht van een externe klant of leerbedrijf. Dit doe je binnen een gesimuleerde maar realistische werkcontext op campus en eventueel in het leerbedrijf van @Work 5, onder begeleiding van een interne coach en externe vakspecialisten.</p><p>Je past de Human-Centered Design-methodologie toe doorheen het volledige proces: van onderzoek tot oplevering. Je realiseert een professioneel eindproduct, legt het proces vast in een productiedossier en bereidt je voor op een vlotte instap in het werkveld.</p><p>Dit opleidingsonderdeel is de ultieme voorbereiding op het fulltime werkplekleren in de laatste periode. Bij voorkeur werk je al één dag per week aan je eindwerk op de toekomstige werkplek, zodat je de bedrijfsorganisatie, bedrijfscultuur en samenwerking met collega’s kan ervaren in de praktijk.</p>",
            "credits": 9,
            "contactHoursPerWeek": 38,
            "period": 7,
            "semester": 4,
            "learningLineCode": "atw",
            "lecturers": ["MVP", "FRG", "NMN", "AGB", "KDS"],
            "tags": [
                "werkplekleren",
                "eindwerk",
                "afstudeerproject",
                "leerbedrijf"
            ]
        },
        {
            "id": "26_27_atw5",
            "name": "@Work 5",
            "subName": "Internship",
            "description": "<p>Je gaat op zoek naar een geschikt leerbedrijf om te werkplekleren. De werkplek-inhoud of takenpakket wordt opgemaakt in overleg met het leerbedrijf, de werkplekstudent en de opleiding.</p><p>Tijdens de werkplekperiode:</p><ul><li>heeft de student regelmatig overleg met de werkplekbegeleider.</li><li>reflecteert een student wekelijks over het werkplekleren m.b.v. o.a. een opvolgingsrooster.</li><li>evalueert een student samen met de werkplekmentor wekelijks over de leerdoelen m.b.v. o.a. opvolgingsrooster en evaluatiematrix.</li><li>formuleert een student samen met de werkplekmentor actiepunten of verbeterdoelen waaraan een student kan werken tijdens een volgende werkplekweek.</li></ul><p>In dit opleidingsonderdeel werk je fulltime binnen een leerbedrijf aan digitale projecten, in een authentieke werkomgeving en onder begeleiding van een werkplekmentor. Je past al je opgedane kennis en vaardigheden toe in de praktijk, maakt deel uit van een professioneel team, leert nieuwe dingen van vakexperten en groeit uit tot een volwaardig junior software developer.</p><p>Je werkt bij voorkeur agile met behulp van tools zoals een Kanban- of Scrumboard, communiceert professioneel met collega’s en neemt verantwoordelijkheid voor je opdrachten. Je stelt je leergierig op, vraagt actief feedback en ontwikkelt je zowel op technisch als professioneel vlak.</p><p>Dit werkplekleren vormt de kroon op je opleiding: een springplank naar je eerste job.</p>",
            "credits": 18,
            "contactHoursPerWeek": 38,
            "period": 8,
            "semester": 4,
            "learningLineCode": "atw",
            "lecturers": ["IDC", "ISB", "IVC", "SSG", "TBD"],
            "tags": [
                "werkplekleren",
                "stage",
                "leerbedrijf"
            ]
        }
    ]
}